{
    "l2d": {
        "link": "l2d",
        "title": "L2D Agency",
        "projectDescription": "L2D's website features a portfolio of their recent work.",
        "mainImage": {
            "path": "main.l2d",
            "alt": "L2D Logo",
            "caption": "The L2D Logo is displayed inside a custom ThreeJS script generated from live video feed data."
        },
        "content": {
            "video": "EYyELvmsw4c",
            "article": "The L2D website reflects a portfolio of work on built into a single page. The custom-built SPA features Greensock animations and transitions. L2D's website features reactivity based on scroll events. L2D also features inline forms validated through native JavaScript and styled with custom SCSS. Each project is loaded dynamically from custom structured data.",
            "externalSite": "//l2d.co/",
            "code": false,
            "techList": [
                "Webpack",
                "Babel|ES7",
                "Vue",
                "Greensock",
                "SCSS"
            ],
            "imageRatio": "62.5%",
            "images": [
                {
                    "path": "eight.l2d",
                    "alt": "Desktop Forms",
                    "caption": "The contact information is displayed along side the contact form."
                },
                {
                    "path": "five.l2d",
                    "alt": "Project Grid",
                    "caption": "The project grid contains advanced SCSS styles to display a dropshadow on hover."
                },
                {
                    "path": "four.l2d",
                    "alt": "ThreeJS Styling",
                    "caption": "The ThreeJS script displays translated video in a 3d pattern with alternative styles."
                },
                {
                    "path": "four.mobile.l2d",
                    "alt": "Form Data",
                    "caption": "The forms are styled with parallaxed background images. The forms are validated through native JavaScript."
                },
                {
                    "path": "one.horiz.l2d",
                    "alt": "Responsive Design",
                    "caption": "The L2D website is responsive and functions across a range of devices."
                },
                {
                    "path": "one.l2d",
                    "alt": "Desktop Header",
                    "caption": "If no one is at the office, the ThreeJS script remains fairly static."
                },
                {
                    "path": "one.mobile.l2d",
                    "alt": "ThreeJS Header",
                    "caption": "The ThreeJS script works cross-device, even on mobile."
                },
                {
                    "path": "seven.l2d",
                    "alt": "Open Menu",
                    "caption": "The menu opens with a dramatic animation over client logos. Meanwhile, other elements move parralax to the background."
                },
                {
                    "path": "three.l2d",
                    "alt": "80s Retro",
                    "caption": "The top of the page can be expanded into a dashboard allowing interaction with the L2D employees as they work. Catch them at the right time, they might wave, \"Hello!\""
                },
                {
                    "path": "three.mobile.l2d",
                    "alt": "Client Logos",
                    "caption": "Client logos are loaded as the user scrolls towards more content. Once loaded, the logos are animated in with the Greensock animation library."
                },
                {
                    "path": "two.mobile.l2d",
                    "alt": "Client Projects",
                    "caption": "Projects are displayed in a flexible grid with corresponding icons and custom animations."
                },
                {
                    "path": "six.l2d"
                },
                {
                    "path": "two.l2d"
                }
            ]
        }
    },
    "sos": {
        "link": "sos",
        "title": "Safe Online Surfing",
        "projectDescription": "SOS features educational games built with HTML5, JavaScript, and CSS. SOS supports legacy browsers, including IE9.",
        "mainImage": {
            "path": "main.sos",
            "alt": "Online Surfing",
            "caption": "A player's character answers questions in order to avoid obstacles while surfing."
        },
        "content": {
            "video": "9XMh78_iCYs",
            "article": "SOS is built with sessionStorage to track users' data. User data is applied via game-state to track interaction. SOS leverages CSS transitions rather than JavaScript animation. SOS supports deprecated browsers such as IE9! The companion NodeJS project allows language translation.",
            "externalSite": "//sos.fbi.gov",
            "code": false,
            "techList": [
                "HTML5",
                "SCSS",
                "Grunt",
                "Javascript",
                "Assemble",
                "JSON",
                "compatibility"
            ],
            "imageRatio": "62.5%",
            "images": [
                {
                    "path": "one.sos",
                    "alt": "Home Page",
                    "caption": "SOS's landing page displays all critical information in a highly visible UI. Students can choose which grade-level character to play as."
                },
                {
                    "path": "eight.sos",
                    "alt": "Treasure Hunt",
                    "caption": "Students must collect all of the hidden coins. Student users must answer a challenge question once a coin is revealed. The coin is collected if the student's answer is correct. The health bar displays the game's status."
                },
                {
                    "path": "eleven.sos",
                    "alt": "Crossing To Safety",
                    "caption": "Line up the board walk to create a path across to the other beach."
                },
                {
                    "path": "fifteen.sos",
                    "alt": "6th Grade",
                    "caption": "Each grade-level has a different island theme with a unique playable character."
                },
                {
                    "path": "five.sos",
                    "alt": "A Challenge",
                    "caption": "Students must answer questions during the games in order to successfully finish."
                },
                {
                    "path": "four.sos",
                    "alt": "Flexible Challenges",
                    "caption": "Questions can be formatted in several ways while using the same general structure and CSS class names."
                },
                {
                    "path": "fourteen.sos",
                    "alt": "Island View",
                    "caption": "Each grade-level island contains several themed challenges."
                },
                {
                    "path": "nine.sos",
                    "alt": "Computer Health",
                    "caption": "Students must keep their character's computer healthy by responding to a series of questions."
                },
                {
                    "path": "seven.sos",
                    "alt": "Safe Surfing",
                    "caption": "A surfing character successfully dodges an obstacle after a correct answer."
                },
                {
                    "path": "six.sos",
                    "alt": "Finish Screen",
                    "caption": "A congratulations screen after successfully completing a challenge."
                },
                {
                    "path": "sixteen.sos",
                    "alt": "Several Characters",
                    "caption": "The island can be configured with placed markers. The markers are numbered and mapped as an individual game."
                },
                {
                    "path": "ten.sos",
                    "alt": "Personal Information",
                    "caption": "To complete this game a user must unlock all the locked spaces."
                },
                {
                    "path": "three.sos",
                    "alt": "Modals",
                    "caption": "This modal presents information about the general contest in order to keep the user's educators informed."
                },
                {
                    "path": "thrirteen.sos",
                    "alt": "Onboarding Instructions",
                    "caption": "Users are presented with a set of instructions for completing each separate contest."
                },
                {
                    "path": "twelve.sos",
                    "alt": "Marine Matching",
                    "caption": "The student must match the word with the definition."
                },
                {
                    "path": "two.sos",
                    "alt": "A Grid of Grades",
                    "caption": "The difficulty of the contest is dependent upon grade level."
                },
                {
                    "path": "seventeen.sos",
                    "alt": "The Results",
                    "caption": "View of a successful completion of the surfing game before the final screen."
                }
            ]
        }
    },
    "rtc": {
        "link": "rtc",
        "title": "Ringgold Telecommunications Company",
        "projectDescription": "A telecommunications provider website built with Foundation and Craft.",
        "mainImage": {
            "path": "main.rtc",
            "alt": "3d Animation",
            "caption": "Custom ThreeJS script featuring waveforms."
        },
        "content": {
            "video": "JqRtOz6CCsE",
            "article": "A proven front-end reliable enough for customers to gain access to essential services. Special attention was paid to accessibility and performance tests. RTC was built to serve the general public with a sleek and stylish performance.",
            "externalSite": "//rtctel.com/",
            "code": false,
            "techList": [
                "Craft CMS",
                "Foundation",
                "Font-Awesome",
                "Grunt",
                "Javascript"
            ],
            "imageRatio": "62.5%",
            "images": [
                {
                    "path": "five.rtc",
                    "alt": "Parallax",
                    "caption": "RTC uses parallaxing elements to emphasize promotional graphics in a two-column responsive layout."
                },
                {
                    "path": "four.mobile.rtc",
                    "alt": "Animations",
                    "caption": "RTC features several animations, including a ThreeJS wave and a throttled SVG animation."
                },
                {
                    "path": "four.rtc",
                    "alt": "Informational Layout",
                    "caption": "The desktop layout features custom styled elements. The YouTube video is progressivly lazy-loaded and then animated in."
                },
                {
                    "path": "one.horiz.rtc",
                    "alt": "Flexible Home Page",
                    "caption": "Responsive view of the header content."
                },
                {
                    "path": "one.mobile.rtc",
                    "alt": "Home Page",
                    "caption": "The home page features a header hierarchy with header text, tagline and button."
                },
                {
                    "path": "one.rtc",
                    "alt": "Home Page",
                    "caption": "The desktop home page features ThreeJS animations."
                },
                {
                    "path": "seven.rtc",
                    "alt": "Integrated Forms",
                    "caption": "RTC features completely custom and styled forms. The forms use native JavaScript along with server-side validation."
                },
                {
                    "path": "six.rtc",
                    "alt": "Slider",
                    "caption": "The slider features unique content in a responsive format."
                },
                {
                    "path": "three.horiz.rtc",
                    "alt": "Speed Graph",
                    "caption": "A CSS animated chart displaying compared internet speeds."
                },
                {
                    "path": "three.mobile.rtc",
                    "alt": "Interior",
                    "caption": "An interior page featuring a video using the YouTube JavaScript API."
                },
                {
                    "path": "three.rtc",
                    "alt": "Footer",
                    "caption": "The footer is highly flexible and utilizes list styling."
                },
                {
                    "path": "two.horiz.rtc",
                    "alt": "Interior Header",
                    "caption": "Interior page headers include movies that autoplay on mobile and desktop."
                },
                {
                    "path": "two.mobile.rtc",
                    "alt": "Forms",
                    "caption": "RTC users can easily connect by using styled forms along with native validation."
                },
                {
                    "path": "two.rtc",
                    "alt": "Interior Content",
                    "caption": "All interior content is created within a template driven CMS."
                }
            ]
        }
    },
    "crg": {
        "link": "crg",
        "title": "Chattanooga Roller Girls",
        "projectDescription": "A Wordpress site built from the Foundation Sites framework",
        "mainImage": {
            "path": "main.crg",
            "alt": "CRG Logo",
            "caption": "The mascot of CRG skates forward while the website loads."
        },
        "content": {
            "video": "",
            "article": "This custom Wordpress theme for the Chattanooga WFTDA Roller Derby features several custom plugins. Advanced User Roles, Custom Categories, Custom Types, Google Analytics... the works! The theme was developed from the ground-up to be versatile. The theme features smooth page transitions for a seamless experience through JavaScript requests.",
            "techList": [
                "Wordpress",
                "PHP",
                "Foundation",
                "SCSS",
                "Grunt",
                "Webpack",
                "Javascript"
            ],
            "code": "https://github.com/shawnnaquin/chattgirls_v2/",
            "externalSite": "https://chattanoogarollergirls.com/",
            "imageRatio": "62.5%",
            "images": [
                {
                    "path": "one.crg",
                    "alt": "Team Logo",
                    "caption": "The team mascot skates by while the data loads."
                },
                {
                    "path": "five.crg",
                    "alt": "Individual Skater",
                    "caption": "Individual skater pages are presented in a slider which tracks the user's page history via the HTML5 HistoryAPI."
                },
                {
                    "path": "five.horiz.crg",
                    "alt": "Next Home Bout",
                    "caption": "The next home bouts are displayed front and center, even on odd sized devices."
                },
                {
                    "path": "two.mobile.crg",
                    "alt": "Mobile Skater",
                    "caption": "An individual's skater page takes up more of the frame on a mobile device."
                },
                {
                    "path": "four.crg",
                    "alt": "Schedule Page",
                    "caption": "The schedule page is a similar layout to the homepage so that users are presented information in a manner that feels familiar."
                },
                {
                    "path": "four.horiz.crg",
                    "alt": "Instagram Feed",
                    "caption": "CRG connects to the live Instagram feed ensuring always current content."
                },
                {
                    "path": "four.mobile.crg",
                    "alt": "Coaches and Staff",
                    "caption": "Coaches and staff are also displayed in a responsive format."
                },
                {
                    "path": "one.horiz.crg",
                    "alt": "Mobile Skater Page",
                    "caption": "Skater's are presented in pairs on mobile devices."
                },
                {
                    "path": "one.mobile.crg",
                    "alt": "Team Mascot Mobile",
                    "caption": "The logo and animation are made using SVG and performant CSS animations."
                },
                {
                    "path": "seven.mobile.crg",
                    "alt": "Alternate Page Transition",
                    "caption": "When switching between interior views, the template transitions smoothly while briefly displaying a small loading animation."
                },
                {
                    "path": "six.crg",
                    "alt": "Sponsor Logos",
                    "caption": "Sponsors are laid out in a responsive grid fixed to an intrinsic ratio."
                },
                {
                    "path": "six.mobile.crg",
                    "alt": "Custom Categories and Fieds",
                    "caption": "CRG's custom Wordpress theme uses custom data and logic to present the season's schedule."
                },
                {
                    "path": "three.crg",
                    "alt": "Desktop Homepage",
                    "caption": "CRG's home page view on a desktop PC."
                },
                {
                    "path": "three.horiz.crg",
                    "alt": "Readable Page",
                    "caption": "CRG's page content is still readable even on tiny devices!"
                },
                {
                    "path": "three.mobile.crg",
                    "alt": "Recent Phots",
                    "caption": "The Instagram API allows the most current team photos to be displayed."
                },
                {
                    "path": "two.crg",
                    "alt": "Banner",
                    "caption": "The home page desktop view displays a banner."
                },
                {
                    "path": "two.horiz.crg",
                    "alt": "Mobile Banner",
                    "caption": "The home page mobile view displays a banner."
                },
                {
                    "path": "five.mobile.crg",
                    "alt": "Mobile Menu",
                    "caption": "On mobile devices, the hamburger menu expands to reveal an off-screen menu."
                }
            ]
        }
    },
    "buntin": {
        "link": "buntin",
        "title": "Buntin Media Group",
        "projectDescription": "The creative advertising agency's responsive unique website was built using VueJS.",
        "mainImage": {
            "path": "main.buntin",
            "alt": "Buntin Logo",
            "caption": "The Buntin logo is presented while the unique experience loads."
        },
        "content": {
            "video": "pjE0QVzCRZk",
            "article": "",
            "externalSite": "//www.buntingroup.com/",
            "code": false,
            "techList": [
                "Babel|ES7",
                "Vue",
                "VueX",
                "CSS-Next",
                "Webpack",
                "Greensock",
                "SVG"
            ],
            "imageRatio": "62.5%",
            "images": [
                {
                    "path": "eight.buntin",
                    "alt": "Parallaxing Content",
                    "caption": "The parallaxing content enters the screen while the user scrolls."
                },
                {
                    "path": "eleven.buntin",
                    "alt": "Adhope Page",
                    "caption": "The Adhope page displays a headline and logos on desktop."
                },
                {
                    "path": "five.buntin",
                    "alt": "Grid Of Images",
                    "caption": "A grid of portfolio images are presented on the client page."
                },
                {
                    "path": "five.horiz.buntin",
                    "alt": "Station Page",
                    "caption": "Each agency card fits within all mobile devices."
                },
                {
                    "path": "five.mobile.buntin",
                    "alt": "Buntin's Story",
                    "caption": "A poster series for multiple years presented in a responsive slider with progressive loading."
                },
                {
                    "path": "four.buntin",
                    "alt": "Main Section",
                    "caption": "While hovering, the main content section reveals a CTA moving in a 3D space."
                },
                {
                    "path": "four.horiz.buntin",
                    "alt": "Buntin Logo",
                    "caption": "The Buntin logo is presented on the first page load."
                },
                {
                    "path": "four.mobile.buntin",
                    "alt": "Poster Page",
                    "caption": "The infomation box is expanded from the info button on the agency's history page."
                },
                {
                    "path": "fourteen.buntin",
                    "alt": "Load Screen",
                    "caption": "The loading screen is displayed before the entire experience."
                },
                {
                    "path": "nine.buntin",
                    "alt": "Card Info",
                    "caption": "Informational cards for each employee stagger in from top to bottom as the page loads."
                },
                {
                    "path": "one.buntin",
                    "alt": "Main Screen",
                    "caption": "The home page on desktop plays a video in the background."
                },
                {
                    "path": "one.horiz.buntin",
                    "alt": "Home Page",
                    "caption": "The home page on mobile is very flexible and can respond to any size."
                },
                {
                    "path": "one.mobile.buntin",
                    "alt": "Home Page",
                    "caption": "The home page presents a powerful video and entices the user to scroll down with a clickable button."
                },
                {
                    "path": "seven.buntin",
                    "alt": "Menu",
                    "caption": "The menu opens to reveal an entire screen and a map via the Google Maps API."
                },
                {
                    "path": "six.buntin",
                    "alt": "Phone slider and Footer",
                    "caption": "The footer also displays a reusable card component, used on the home page just below the image slider."
                },
                {
                    "path": "ten.buntin",
                    "alt": "Logo Grid",
                    "caption": "A grid of logos which displays SVGs in a waterfall animation."
                },
                {
                    "path": "thirteen.buntin",
                    "alt": "Contact",
                    "caption": "The contact page is the last station in the main view."
                },
                {
                    "path": "three.buntin",
                    "alt": "Section Header",
                    "caption": "A navigation bar is displayed below the section headers and accompanying paragraph text."
                },
                {
                    "path": "three.horiz.buntin",
                    "alt": "Interior Page",
                    "caption": "The interior view shows a header image and title along with left and right arrows advancing users between the section content."
                },
                {
                    "path": "three.mobile.buntin",
                    "alt": "Adhope Page",
                    "caption": "Floating information boxes of logos and text tells a story."
                },
                {
                    "path": "twelve.buntin",
                    "alt": "History Page",
                    "caption": "A view of the history page on desktop."
                },
                {
                    "path": "two.horiz.buntin",
                    "alt": "Scrolling Through",
                    "caption": "Users can scroll through entire sections presented as cards."
                },
                {
                    "path": "two.mobile.buntin",
                    "alt": "Main Station",
                    "caption": "Each section is presented on a card delivered along a scrollable path."
                },
                {
                    "path": "two.buntin"
                }
            ]
        }
    },
    "drm": {
        "link": "drm",
        "title": "Deer Run Media",
        "projectDescription": "Craft CMS template features a unique boutique video agency content.",
        "mainImage": {
            "path": "main.drm",
            "caption": "Deer Run Media Logo",
            "alt": "The logo is presented to users on the first load in a dramatic film-type presentation."
        },
        "content": {
            "externalSite": "//deerrunmedia.com/",
            "video": "GqNosljNlTk",
            "code": false,
            "article": "Deer Run Media, a local visual art and production company, shows off unique films while minimizing UI. Featuring a completely custom HTML5 video player this theme makes extensive use of the HTML5 Video API.",
            "techList": [
                "Craft CMS",
                "HTML5",
                "Video",
                "SCSS",
                "Foundation",
                "Greensock",
                "Babel|ES7",
                "Grunt",
                "History API"
            ],
            "imageRatio": "56.25%",
            "images": [
                {
                    "path": "five.drm",
                    "alt": "Get A Quote",
                    "caption": "The form uses a JavaScript API to POST forms."
                },
                {
                    "path": "five.mobile.drm",
                    "alt": "Projects",
                    "caption": "Projects are presented in similar ways on desktop and mobile."
                },
                {
                    "path": "four.drm",
                    "alt": "Contact Page",
                    "caption": "The contact page as viewed on a desktop PC."
                },
                {
                    "path": "four.mobile.drm",
                    "alt": "Contact Us",
                    "caption": "The contact page on a mobile device."
                },
                {
                    "path": "one.drm",
                    "alt": "Project Page",
                    "caption": "The project page features a slider with flexible content. The slider's content may contain images or supporting film pieces."
                },
                {
                    "path": "one.mobile.drm",
                    "alt": "DRM Logo",
                    "caption": "The DRM logo on mobile."
                },
                {
                    "path": "seven.mobile.drm",
                    "alt": "Mobile Behind the Scenes",
                    "caption": "DRM's images are presented on a mobile device."
                },
                {
                    "path": "six.mobile.drm",
                    "alt": "Project Page",
                    "caption": "An example project page as viewed on a mobile device."
                },
                {
                    "path": "three.drm",
                    "alt": "Home Page",
                    "caption": "The home page features interactive video segments that autoplay on mouse hover."
                },
                {
                    "path": "three.mobile.drm",
                    "alt": "About Page",
                    "caption": "Some basic content is presented on an about page."
                },
                {
                    "path": "two.drm",
                    "alt": "Case Studies",
                    "caption": "Case studies are presented in a grid format on desktop."
                },
                {
                    "path": "two.mobile.drm",
                    "alt": "Home Page",
                    "caption": "A view of the mobile home page with inline video."
                }
            ]
        }
    }
}